Revit 2027 API
InsulationLiningBase.Thickness Property
 Thickness of the insulation or lining element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Thickness { get; set; }
Public Property Thickness As Double
	Get
	Set
public:
property double Thickness {
	double get ();
	void set (double value);
}
member Thickness : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: Thickness is not valid for assignment to insulation or lining elements.
See Also
Reference
InsulationLiningBase Class
Autodesk.Revit.DB Namespace